MyHome/src/Documents/мх_ВводОстатков/мх_ВводОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мх_ВводОстатков</name>
  <registerRecords>AccumulationRegister.мх_ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.мх_ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.мх_Доходы</registerRecords>
  <registerRecords>AccumulationRegister.мх_Расходы</registerRecords>
  <attributes>
    <name>ОбъектУчета</name>
    <type>
      <types>CatalogRef.мх_КошелькиИСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

MyHome/src/AccumulationRegisters/мх_ДвиженияДенежныхСредств/мх_ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>мх_ДвиженияДенежныхСредств</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбойЗнак</types>
    </type>
  </resources>
  <dimensions>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.мх_КошелькиИСчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

MyHome/src/Documents/мх_ВводОстатков/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ДвиженияДокумента

Процедура ИнициализироватьТаблицыДляДвижений(ДокументОбъект) Экспорт

	Граница = Новый Граница(ДокументОбъект.МоментВремени(), ВидГраницы.Исключая);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("Граница", Граница);
	Запрос.УстановитьПараметр("Кошелек", ДокументОбъект.ОбъектУчета);
	Запрос.УстановитьПараметр("Дата", ДокументОбъект.Дата);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвиженияДенежныхСредствОстатки.Кошелек,
	|	ДвиженияДенежныхСредствОстатки.Кошелек.Валюта КАК Валюта,
	|	-ДвиженияДенежныхСредствОстатки.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ ПредварительныеДанные
	|ИЗ
	|	РегистрНакопления.мх_ДвиженияДенежныхСредств.Остатки(&Граница, Кошелек = &Кошелек) КАК ДвиженияДенежныхСредствОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВводОстатков.ОбъектУчета,
	|	ВводОстатков.ОбъектУчета.Валюта,
	|	ВводОстатков.Сумма
	|ИЗ
	|	Документ.мх_ВводОстатков КАК ВводОстатков
	|ГДЕ
	|	ВводОстатков.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Ссылка КАК Регистратор,
	|	&Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПредварительныеДанные.Кошелек,
	|	ПредварительныеДанные.Валюта,
	|	СУММА(ПредварительныеДанные.Сумма) КАК Сумма
	|ИЗ
	|	ПредварительныеДанные КАК ПредварительныеДанные
	|СГРУППИРОВАТЬ ПО
	|	ПредварительныеДанные.Кошелек,
	|	ПредварительныеДанные.Валюта,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)";

	РезультатЗапроса = Запрос.ВыполнитьПакет();

	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ТаблицаДвиженияДенежныхСредств", РезультатЗапроса[1].Выгрузить());

	ДокументОбъект.ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", СтруктураРезультата);

КонецПроцедуры

Процедура ОтразитьДвиженияДенежныхСредств(Документ, Отказ) Экспорт

	ТаблицаДвижений = Документ.ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДвиженияДенежныхСредств;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ДвиженияДенежныхСредств = Документ.Движения.мх_ДвиженияДенежныхСредств;
	ДвиженияДенежныхСредств.Записывать = Истина;
	ДвиженияДенежныхСредств.Загрузить(ТаблицаДвижений);

КонецПроцедуры

#КонецОбласти

#КонецОбласти	

#КонецЕсли
